test_one = """Но мало кто говорит, что даже
узаконенный постулат приема жидкости во время и после еды
нарушает технологию переработки пищи, разбавляя пищева-
рительные соки,
концентрации
которых уже не хватает для
организма, поэтому он зашлаковывается и закисляется, что и
является одной из важных причин возникновения заболева-
ний, характер которых не имеет значения. Не вдаваясь в осо-
бенности всех проблем официальной медицины, на основании
многолетнего опыта работы в космонавтике и проведенных
научно-исследовательских и прикладных работ можно сделать
следующие выводы:
•
человек
-
это самодостаточная и саморегулирующаяся си-
стема, резервные возможности которой в
8-1 О
раз сильнее
любого повреждающего фактора и в которой все связано и
взаимозависимо;
•
•
болезней как таковых нет, а есть состояние, которое можно
восстановить, избавив пациента от имеющихся проблем, и
предупредить возникновение возможных заболеваний;
нарушение работы пищеварительного тракта приводит вна-
чале к функциональным, а затем к патологическим сдвигам
в обменных процессах, органах и системах организма, его
закислению, что в свою очередь приводит к активации па-
тогенной микрофлоры, не нормализовав которую излечить
•
больного нельзя.
знание пациентом основных физиологическ:Их, биохими-
ческих и энергетических процессов, происходящих в орга-
низме необходимо, и также необходимо делать все, чтобы
эндоэкологическая среда работала в чистом виде. Физиче-
ское тело человека дано во временное пользование на Земле
и должно содержаться в чистом виде, как любое техническое
средство, чему человека, к сожалению, никто не учит, что и
является основной причиной возникновения заболеваний,
характер которых не имеет значения."""